In [1]:
import pandas
pandas.__version__

'0.23.4'

In [5]:
import pandas as pd
import numpy as np

### Pandas Series Object

In [6]:
data=pd.Series([0.25,0.5,0.75,1.0])
data

0    0.25
1    0.50
2    0.75
3    1.00
dtype: float64

In [7]:
data.values

array([0.25, 0.5 , 0.75, 1.  ])

In [8]:
data.index

RangeIndex(start=0, stop=4, step=1)

In [9]:
data[1]

0.5

In [10]:
data[1:3]

1    0.50
2    0.75
dtype: float64

In [19]:
data=pd.Series([0.25,0.5,0.75,1.0],
         index=list('abcd'))

In [20]:
data['b']

0.5

In [21]:
data=pd.Series([0.25,0.5,0.75,1.0],
              index=[2,5,3,7])
data

2    0.25
5    0.50
3    0.75
7    1.00
dtype: float64

In [22]:
data[5]

0.5

Series는 특수한 딕셔너리와 같이 생각 가능

In [23]:
population_dict={'California':38332521,
                'Texas':26448193,
                'New York':19651127,
                'Florida':19552860,
                'Illinois':12882135}
population=pd.Series(population_dict)
population

California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135
dtype: int64

In [24]:
population['California']

38332521

In [26]:
population['California':'New York']

California    38332521
Texas         26448193
New York      19651127
dtype: int64

### Pandas DataFrame Object

Series ~ 유연한 index의 1차원 배열  
DataFrame ~ 유연한 행 index와 유연한 열 이름을 가진 2차원 배열

In [27]:
area_dict= {'California': 423967, 'Texas':695662, 'New York': 141297,'Florida': 170312, "Illinois": 149995}
area=pd.Series(area_dict)
area

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
dtype: int64

In [28]:
states=pd.DataFrame({'population':population, 'area':area})
states

            population    area
California    38332521  423967
Texas         26448193  695662
New York      19651127  141297
Florida       19552860  170312
Illinois      12882135  149995

In [29]:
states.index

Index(['California', 'Texas', 'New York', 'Florida', 'Illinois'], dtype='object')

In [30]:
states.columns

Index(['population', 'area'], dtype='object')

In [32]:
states['area']

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

### Pandas Index Object

In [34]:
ind=pd.Index([2,3,5,7,11])
ind

Int64Index([2, 3, 5, 7, 11], dtype='int64')

In [35]:
ind[1]=0

TypeError: Index does not support mutable operations

Index object is immutable  
index ~ ordered set

In [46]:
indA = pd.Index([1,3,5,7,9])
indB = pd.Index([2,3,5,7,11])

In [47]:
indA & indB

Int64Index([3, 5, 7], dtype='int64')

In [48]:
indA | indB

Int64Index([1, 2, 3, 5, 7, 9, 11], dtype='int64')

In [49]:
indA ^ indB

Int64Index([1, 2, 9, 11], dtype='int64')

### Indexing with loc iloc

In [51]:
data = pd.Series(['a','b','c'], index=[1,3,5])
data

1    a
3    b
5    c
dtype: object

loc ~ 명시적인 인덱스 참조

In [52]:
data.loc[1]

'a'

In [54]:
data.loc[1:3]

1    a
3    b
dtype: object

iloc ~ python 스타일의 암묵적인 인덱스 참조

In [56]:
data.iloc[1]

'b'

In [57]:
data.iloc[1:3]

3    b
5    c
dtype: object

### Indexing in DataFrame

In [59]:
area=pd.Series({'California': 423967, 'Texas':695662, 'New York':141297, 'Florida': 170312, 'Illinois': 149995})
pop=pd.Series({'California':38332521, 'Texas':26448193, 'New York':19651127, "Florida":19552860, "Illinois":12882135})
data=pd.DataFrame({'area':area, 'pop':pop})
data

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127
Florida     170312  19552860
Illinois    149995  12882135

In [60]:
data['area']

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [61]:
data.area

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [62]:
data['density']=data['pop'] / data['area']
data

              area       pop     density
California  423967  38332521   90.413926
Texas       695662  26448193   38.018740
New York    141297  19651127  139.076746
Florida     170312  19552860  114.806121
Illinois    149995  12882135   85.883763

In [67]:
data.values

array([[4.23967000e+05, 3.83325210e+07, 9.04139261e+01],
       [6.95662000e+05, 2.64481930e+07, 3.80187404e+01],
       [1.41297000e+05, 1.96511270e+07, 1.39076746e+02],
       [1.70312000e+05, 1.95528600e+07, 1.14806121e+02],
       [1.49995000e+05, 1.28821350e+07, 8.58837628e+01]])

In [68]:
data.T

           California         Texas      New York       Florida      Illinois
area     4.239670e+05  6.956620e+05  1.412970e+05  1.703120e+05  1.499950e+05
pop      3.833252e+07  2.644819e+07  1.965113e+07  1.955286e+07  1.288214e+07
density  9.041393e+01  3.801874e+01  1.390767e+02  1.148061e+02  8.588376e+01

In [69]:
data.values[0]

array([4.23967000e+05, 3.83325210e+07, 9.04139261e+01])

In [70]:
data['area']

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [71]:
data.iloc[:3,:2]

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127

In [73]:
data.loc[:'Florida',:'pop']

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127
Florida     170312  19552860

ix = loc, iloc의 hybrid

In [74]:
data.ix[:3,:'pop']

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127

ix는 쓰지말자;

### Null 연산

In [2]:
import pandas as pd
import numpy as np
data= pd.Series([1,np.nan, 'hello', None])

In [3]:
data.isnull()

0    False
1     True
2    False
3     True
dtype: bool

In [4]:
data[data.notnull()]

0        1
2    hello
dtype: object

In [5]:
data.dropna()

0        1
2    hello
dtype: object

In [6]:
df=pd.DataFrame([[1,np.nan,2],
                [2,3,5],
                [np.nan,4,6]])
df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [7]:
df.dropna()

     0    1  2
1  2.0  3.0  5

In [8]:
df.dropna(axis='columns')

   2
0  2
1  5
2  6

In [9]:
df[3]=np.nan
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [10]:
df.dropna(axis=1, how='all')

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

모두 Null인 경우 삭제

In [11]:
df.dropna(axis=0, thresh=3)

     0    1  2   3
1  2.0  3.0  5 NaN

Null이 아닌 값이 최소 3개 있는 것만 살린다

### Hierarchical Indexing

In [20]:
index=[('California', 2000), ('California',2010),
      ('New York', 2000), ('New York', 2010),
      ('Texas', 2000), ('Texas', 2010)]
populations=[33871648,37253956,18976457,19378102,20851820,25145561]
pop=pd.Series(populations,index=index)

In [21]:
pop

(California, 2000)    33871648
(California, 2010)    37253956
(New York, 2000)      18976457
(New York, 2010)      19378102
(Texas, 2000)         20851820
(Texas, 2010)         25145561
dtype: int64

In [22]:
index = pd.MultiIndex.from_tuples(index)
index

MultiIndex(levels=[['California', 'New York', 'Texas'], [2000, 2010]],
           labels=[[0, 0, 1, 1, 2, 2], [0, 1, 0, 1, 0, 1]])

In [23]:
pop=pop.reindex(index)
pop

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [24]:
pop[:,2010]

California    37253956
New York      19378102
Texas         25145561
dtype: int64

In [25]:
pop_df=pop.unstack()
pop_df

                2000      2010
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

unstack을 통해 다중 index를 가진 Series를 DataFrame으로

In [26]:
pop_df.stack()

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

반대도 가능

In [27]:
pop_df=pd.DataFrame({'total':pop,
                    'under18':[9267089,9284094,
                              4687374,4318033,
                              5906301, 6879014]})
pop_df

                    total  under18
California 2000  33871648  9267089
           2010  37253956  9284094
New York   2000  18976457  4687374
           2010  19378102  4318033
Texas      2000  20851820  5906301
           2010  25145561  6879014

MultiIndex를 사용한 DataFrame의 Data 추가

### Pandas MultiIndex 생성자

In [28]:
pd.MultiIndex.from_arrays([['a','a','b','b'],[1,2,1,2]])

MultiIndex(levels=[['a', 'b'], [1, 2]],
           labels=[[0, 0, 1, 1], [0, 1, 0, 1]])

각 level의 index값을 알려주는 배열로

In [29]:
pd.MultiIndex.from_tuples([('a',1),('a',2),('b',1),('b',2)])

MultiIndex(levels=[['a', 'b'], [1, 2]],
           labels=[[0, 0, 1, 1], [0, 1, 0, 1]])

각 점의 인덱스 값을 제공하는 튜플로

In [30]:
pd.MultiIndex.from_product([['a','b'], [1,2]])

MultiIndex(levels=[['a', 'b'], [1, 2]],
           labels=[[0, 0, 1, 1], [0, 1, 0, 1]])

Cartesian product로

In [32]:
pd.MultiIndex(levels=[['a','b'],[1,2]],
             labels=[[0,0,1,1],[0,1,0,1]])

MultiIndex(levels=[['a', 'b'], [1, 2]],
           labels=[[0, 0, 1, 1], [0, 1, 0, 1]])

level과 label을 직접 명시  
levels : 각 레벨에서 사용할 수 있는 인덱스 값을 담고 있는 리스트의 리스트  
labels : 이 레이블을 참조하는 리스트의 리스트

In [33]:
pop.index.names=['state','year']
pop

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

MultiIndex의 레벨에 이름 지정하기

### 열의 MultiIndex

In [34]:
index= pd.MultiIndex.from_product([[2013,2014],[1,2]], names=['year','visit'])
columns= pd.MultiIndex.from_product([['Bob','Guido','Sue'],['HR','Temp']], names=['subject','type'])

In [38]:
data=np.round(np.random.randn(4,6),1)
data[:,::2] *=10
data+=37
data

array([[32. , 35.4, 30. , 37.1, 36. , 36.9],
       [36. , 37. , 30. , 37.1, 26. , 37.6],
       [29. , 35.6, 32. , 37.1, 46. , 37.6],
       [37. , 37.2, 56. , 35.8, 34. , 37.1]])

In [39]:
health_data=pd.DataFrame(data, index=index, columns=columns)
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      32.0  35.4  30.0  37.1  36.0  36.9
     2      36.0  37.0  30.0  37.1  26.0  37.6
2014 1      29.0  35.6  32.0  37.1  46.0  37.6
     2      37.0  37.2  56.0  35.8  34.0  37.1

In [40]:
health_data['Guido']

type          HR  Temp
year visit
2013 1      30.0  37.1
     2      30.0  37.1
2014 1      32.0  37.1
     2      56.0  35.8

### MultiIndex 인덱싱 및 슬라이싱

multiIndex를 가진 Series

In [54]:
pop

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [55]:
pop['California',2000]

33871648

In [56]:
pop['California']

year
2000    33871648
2010    37253956
dtype: int64

In [57]:
pop.loc['California':'New York']

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
dtype: int64

In [58]:
pop[:,2000]

state
California    33871648
New York      18976457
Texas         20851820
dtype: int64

In [60]:
pop[pop>22000000]

state       year
California  2000    33871648
            2010    37253956
Texas       2010    25145561
dtype: int64

In [61]:
pop[['California','Texas']]

state       year
California  2000    33871648
            2010    37253956
Texas       2000    20851820
            2010    25145561
dtype: int64

In [62]:
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      32.0  35.4  30.0  37.1  36.0  36.9
     2      36.0  37.0  30.0  37.1  26.0  37.6
2014 1      29.0  35.6  32.0  37.1  46.0  37.6
     2      37.0  37.2  56.0  35.8  34.0  37.1

MultiIndex를 가진 DataFrame

In [63]:
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      32.0  35.4  30.0  37.1  36.0  36.9
     2      36.0  37.0  30.0  37.1  26.0  37.6
2014 1      29.0  35.6  32.0  37.1  46.0  37.6
     2      37.0  37.2  56.0  35.8  34.0  37.1

In [64]:
health_data['Guido','HR']

year  visit
2013  1        30.0
      2        30.0
2014  1        32.0
      2        56.0
Name: (Guido, HR), dtype: float64

DataFrame의 기본 요소는 Column, Series에 사용된 구문이 Column에 적용된다

In [69]:
health_data.iloc[:2,:2]

subject      Bob
type          HR  Temp
year visit
2013 1      32.0  35.4
     2      36.0  37.0

loc,iloc등은 행,열 순서로 적용

In [78]:
health_data.loc[:,('Bob','HR')]

year  visit
2013  1        32.0
      2        36.0
2014  1        29.0
      2        37.0
Name: (Bob, HR), dtype: float64

index 튜플 사용

In [79]:
health_data.loc[(:,1),(:,'HR')]

SyntaxError: invalid syntax (<ipython-input-79-2d8e6b30864e>, line 1)

index 튜플 내에서 슬라이싱은 에러

In [80]:
idx= pd.IndexSlice
health_data.loc[idx[:,1], idx[:,'HR']]

subject      Bob Guido   Sue
type          HR    HR    HR
year visit
2013 1      32.0  30.0  36.0
2014 1      29.0  32.0  46.0

pandas IndexSlice 객체를 사용해서 슬라이싱하자

In [81]:
pop

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [82]:
pop.unstack(level=0)

state  California  New York     Texas
year
2000     33871648  18976457  20851820
2010     37253956  19378102  25145561

In [83]:
pop.unstack(level=1)

year            2000      2010
state
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

In [85]:
pop.unstack().stack()

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [87]:
pop_flat=pop.reset_index(name='population')
pop_flat

        state  year  population
0  California  2000    33871648
1  California  2010    37253956
2    New York  2000    18976457
3    New York  2010    19378102
4       Texas  2000    20851820
5       Texas  2010    25145561

index레이블을 열로 바꾸기  
이러한 데이터를 MultiIndex로 만드는 작업도 가능

In [88]:
pop_flat.set_index(['state','year'])

                 population
state      year
California 2000    33871648
           2010    37253956
New York   2000    18976457
           2010    19378102
Texas      2000    20851820
           2010    25145561

### Merging DataFrame

In [91]:
df1= pd.DataFrame({'employee':['Bob','Jake','Lisa','Sue'],
                  'group':['Accounting','Engineering','Engineering','HR']})
df2=pd.DataFrame({'employee':['Lisa','Bob','Jake','Sue'],
                 'hire_date':[2004, 2008, 2012, 2014]})
print(df1);print(df2)

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014

In [92]:
print(df1); print(df2); print(pd.merge(df1,df2,on='employee'))

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014
  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

on으로 병합할 열 이름 지정

In [93]:
df3=pd.DataFrame({'name':['Bob', 'Jake', 'Lisa', 'Sue'],
                 'salary':[70000, 80000, 120000, 90000]})
print(df1); print(df3);
print(pd.merge(df1, df3, left_on='employee', right_on='name'))

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
   name  salary
0   Bob   70000
1  Jake   80000
2  Lisa  120000
3   Sue   90000
  employee        group  name  salary
0      Bob   Accounting   Bob   70000
1     Jake  Engineering  Jake   80000
2     Lisa  Engineering  Lisa  120000
3      Sue           HR   Sue   90000

서로 다른 열 이름을 가지고 있을 때, 중복된 열 발생

In [95]:
pd.merge(df1, df3, left_on='employee', right_on='name').drop('name',axis=1)

  employee        group  salary
0      Bob   Accounting   70000
1     Jake  Engineering   80000
2     Lisa  Engineering  120000
3      Sue           HR   90000

In [97]:
df1a=df1.set_index('employee')
df2a=df2.set_index('employee')
print(df1a);print(df2a)

                group
employee
Bob        Accounting
Jake      Engineering
Lisa      Engineering
Sue                HR
          hire_date
employee
Lisa           2004
Bob            2008
Jake           2012
Sue            2014

In [99]:
pd.merge(df1a, df2a, left_index=True, right_index=True)

                group  hire_date
employee
Bob        Accounting       2008
Jake      Engineering       2012
Lisa      Engineering       2004
Sue                HR       2014

병합 키로 index 사용

In [100]:
df1a.join(df2a)

                group  hire_date
employee
Bob        Accounting       2008
Jake      Engineering       2012
Lisa      Engineering       2004
Sue                HR       2014

index 기반으로 병합하는 join과 같음

In [101]:
print(df1a); print(df3)
print(pd.merge(df1a, df3, left_index=True, right_on='name'))

                group
employee
Bob        Accounting
Jake      Engineering
Lisa      Engineering
Sue                HR
   name  salary
0   Bob   70000
1  Jake   80000
2  Lisa  120000
3   Sue   90000
         group  name  salary
0   Accounting   Bob   70000
1  Engineering  Jake   80000
2  Engineering  Lisa  120000
3           HR   Sue   90000

index와 열을 섞어서 사용

### Grouping 예제

In [102]:
import seaborn as sns
planets = sns.load_dataset('planets')
planets.shape

(1035, 6)

In [104]:
planets.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

2014년까지 발견된 외계 행성에 대한 정보를 담은 dataset

In [107]:
planets.groupby('method')

In [109]:
planets.groupby('method')['orbital_period'].median()

method
Astrometry                         631.180000
Eclipse Timing Variations         4343.500000
Imaging                          27500.000000
Microlensing                      3300.000000
Orbital Brightness Modulation        0.342887
Pulsar Timing                       66.541900
Pulsation Timing Variations       1170.000000
Radial Velocity                    360.200000
Transit                              5.714932
Transit Timing Variations           57.011000
Name: orbital_period, dtype: float64

각 방법이 예민하게 감지해내는 궤도 주기의 중간값

In [110]:
for method, group in planets.groupby('method'):
    print('{0:30s} shape={1}'.format(method, group.shape))

Astrometry                     shape=(2, 6)
Eclipse Timing Variations      shape=(9, 6)
Imaging                        shape=(38, 6)
Microlensing                   shape=(23, 6)
Orbital Brightness Modulation  shape=(3, 6)
Pulsar Timing                  shape=(5, 6)
Pulsation Timing Variations    shape=(1, 6)
Radial Velocity                shape=(553, 6)
Transit                        shape=(397, 6)
Transit Timing Variations      shape=(4, 6)

그룹을 직접 순회할 수 있도록 지원, 각 그룹을 Series나 DataFrame으로 반환  
직접 순회보다는 내장된 Apply기능을 사용하는게 더 빠르다.

In [114]:
planets.groupby('method')['year'].describe()

,count,mean,std,min,25%,50%,75%,max
method,,,,,,,,
Astrometry,2.0,2011.500000,2.121320,2010.0,2010.75,2011.5,2012.25,2013.0
Eclipse Timing Variations,9.0,2010.000000,1.414214,2008.0,2009.00,2010.0,2011.00,2012.0
Imaging,38.0,2009.131579,2.781901,2004.0,2008.00,2009.0,2011.00,2013.0
Microlensing,23.0,2009.782609,2.859697,2004.0,2008.00,2010.0,2012.00,2013.0
Orbital Brightness Modulation,3.0,2011.666667,1.154701,2011.0,2011.00,2011.0,2012.00,2013.0
Pulsar Timing,5.0,1998.400000,8.384510,1992.0,1992.00,1994.0,2003.00,2011.0
Pulsation Timing Variations,1.0,2007.000000,NaN,2007.0,2007.00,2007.0,2007.00,2007.0
Radial Velocity,553.0,2007.518987,4.249052,1989.0,2005.00,2009.0,2011.00,2014.0
Transit,397.0,2011.236776,2.077867,2002.0,2010.00,2012.0,2013.00,2014.0
Transit Timing Variations,4.0,2012.500000,1.290994,2011.0,2011.75,2012.5,2013.25,2014.0

In [115]:
decade= 10*(planets['year']//10)
decade= decade.astype(str)+'s'
decade.name='decade'
decade

0       2000s
1       2000s
2       2010s
3       2000s
4       2000s
5       2000s
6       2000s
7       1990s
8       2000s
9       2010s
10      2010s
11      2000s
12      2000s
13      1990s
14      2000s
15      2000s
16      1990s
17      1990s
18      2000s
19      2000s
20      2010s
21      2000s
22      2000s
23      2000s
24      2000s
25      1990s
26      2010s
27      2000s
28      2010s
29      2000s
        ...
1005    2010s
1006    2010s
1007    2010s
1008    2010s
1009    2010s
1010    2010s
1011    2010s
1012    2010s
1013    2010s
1014    2010s
1015    2010s
1016    2010s
1017    2010s
1018    2010s
1019    2010s
1020    2010s
1021    2010s
1022    2010s
1023    2010s
1024    2010s
1025    2010s
1026    2010s
1027    2010s
1028    2010s
1029    2010s
1030    2000s
1031    2000s
1032    2000s
1033    2000s
1034    2000s
Name: decade, Length: 1035, dtype: object

In [118]:
planets.groupby(['method',decade])['number'].sum().unstack().fillna(0)

decade                         1980s  1990s  2000s  2010s
method
Astrometry                       0.0    0.0    0.0    2.0
Eclipse Timing Variations        0.0    0.0    5.0   10.0
Imaging                          0.0    0.0   29.0   21.0
Microlensing                     0.0    0.0   12.0   15.0
Orbital Brightness Modulation    0.0    0.0    0.0    5.0
Pulsar Timing                    0.0    9.0    1.0    1.0
Pulsation Timing Variations      0.0    0.0    1.0    0.0
Radial Velocity                  1.0   52.0  475.0  424.0
Transit                          0.0    0.0   64.0  712.0
Transit Timing Variations        0.0    0.0    0.0    9.0

언제 어떻게 행성을 발견했는지에 대한 정보를 한눈에 파악할 수 있다.